const translator = require('myanglish-translator-js').default;
const { ConvertMode } = require('myanglish-translator-js');

// console.log(translator.myanmarWordSpliter("hello ကျွန်မတို့နိုင်ငံတော်ကြီးက"))


// import translator from 'myanglish-translator-js';
// import { Mode } from 'myanglish-translator-js'



console.log(translator.myanmarWordSpliter(`
    အိမ်ခြံမြေ တစ်ခုအား Special Power ဖြင့် ဝယ်ယူခဲ့ပြီး ကာလ ၃ နှစ်ကျော် ကြာခဲ့၍ (Sp) Expired ဖြစ်သွားသော အခါ မည်ကဲ့သို့ဆက်လက်ဆောင်ရွက်ရမည်နည်း
*******************************************
ယခု စာဖတ်သူသိချင်နေတဲ့မေးခွန်း က ၃နှစ်ကျော်သွားပြီ သက်တမ်း ကုန်သွားပြီလို့ထင်နေတာ မဟုတ်ပါဘူး လို့ရှေးဦးစွာပြောကြားချင်ပါတယ်။ ဘာကြောင့်လဲ ဆိုတော့မိတ်ဆွေ ကိုဘဲစာချုပ်စာတမ်း ရုံး မှာ မှတ်ပုံတင်ထားပြီ တဲ့..အထူးကိုယ်စားလှယ် လွှဲစာ (speical power) က ၃ နှစ်ကျော်သွားရင် သုံးမရတော့ဘူးလို့လူအများ နားလည်နေကြပါတယ် ။
ဒီလိုထင်မြင်တာလည်း မှားတယ်လို့မပြောနိုင်ပါဘူး ။ ဘာကြောင့် အမှတ်မှား ကြသလဲလို့ ထင်နေကြသလဲလို့မေးခွန်း ထုတ်ကြည့်ရင် ရန်ကုန် မြို့တော် စည်ပင်သာယာရေးကော်မတီ၊ မြို့ပြစီမံကိန်း နဲ့မြေစီမံခန့်ခွဲ မှု ဌာန ကစတင် သတ်မှတ် ခဲ့ တယ်လို့ဆိုရင် မှားအံမထင်ပါ ။ အဲဒီ ဌာနမှာ စုံစမ်းမေမြန်း ဖို့ Complane Section ဖွင့်ထားပါတယ် ။ ကြှနျုပျလညျး ၃ နှစ်ကန့်သတ်ချက် နဲ့ပတ်သက် လို့ စောဒက တက်ပြီးမေးမြန်း ဖူးပါတယ်။ အဲဒီ ဌာန ကအကြီးအကဲ ကရှင်းပြတာကတော့သက်တမ်း (၅) နှစ် (၁၀ ) နှစ် စသည် ဖြင့် (speical power), (general power ) (SP, GP ) ပေးထားသူတွေမှာ အချို့က သက်ရှိ ထင်ရှားရှိမနေကြတော့ပါဘူး။ သေကုန်ကြပါ ပြီ ။ ဒီလို GP,SP power ပေး သူသေရင် GP ,SP Power ကလည်းသူသေရင် သုံးလို့မရတော့ဘူး ။ ပါဝါ လည်းလိုက်သေသွားတယ်လို့ပြောရမှာပေါ့။ ဒါပေမဲ့ GP ,SP ပါဝါ ရထားတဲ့သူတွေ ကပါဝါပေးသူသေသွားကြတာကို ဖုံးကွယ် ထားကြတယ်တဲ့ ။ ကာယကံရှင် ထံက GP,SP ပါဝါ ယူထားသူ အတော်များများ ဟာ ဝယ်ထား တဲ့ဂရန် မြေကွက် ကို အမည်မပြောင်းချင်ဘဲ အမည်ပေါက်ထံက GP ,SP ပါဝါ ယူထားတက်ကြလို့ဘဲ။
ဂရန် အမည်ပေါက် ထံ က( GP,SP) ပါဝါ ယူထားရင်အခွန်ဆောင်စရာမလို၊ အမည်ပြောင်း စရာမလိုဘူးပေါ့။ မိမိဝယ်ထားတယ်ဆိုတာလည်း အခွန်ဦးစီးဌာန ကမသိဘူးပေါ့။ ပွင့်ပွင့်လင်းလင်းပြောရရင် အခွန်ရှောင်တာပါပဲ။ အဲဒါပေမဲ့  လူဘဝ ဆိုတာက ကိုယ် ဖြစ်ချင်တာမဖြစ် ၊သူဖြစ်ချင်သလို ဖြစ်တက်တဲ့ အနတ္တ အစိုးမရတဲ့သဘော တရားရှိတယ်  မဟုတ်လား။ မမျှော်လင့်ဘဲ ဂရန် အမည်ပေါက် သူကရုတ်တရက် နှုတ်မဆက် ပဲသေဆုံးသွားတဲ့အခါ (GP,SP ) ပါဝါ ကိုင်ထားတဲ့သူဟာမျောက်မီးခဲ ကိုင်မိသလို ဖြစ်တော့တာပါပဲ။ အမည်ပြောင်းဖို့ အမြန်ပြောင်းမှ ဖြစ်မယ်။ နို့မဟုတ်ရင် အမည်ပေါက် ရဲ့ဇနီး၊ ခင်ပွန်း သားသမီး များ ကဝင်နှောင့်ယှက်ရင် ဘယ်လိုလုပ်မလဲ ဟုအတွေးဝင်လာတဲ့အခါ၊ GP, SP ပါဝါ ပေးသူမှာ ယနေ့တိုင် အသက် ထင်ရှားရှိပါကြောင်း ၊သူပေးထားတဲ့power ဟာလည်း ယနေ့တိုင် ပြန် လည်ရုပ်သိမ်းခြင်း မရှိသေးပါဘူးလို့လိမ်လည် ကျမ်းကျိန်ပြီး ရန်ကုန် မြို့တော် ခန်း မမှာ အရောင်းအဝယ်စာချုပ်ရန် ဆိုပြီး မြေပုံ မြေရာဇဝင် လာကူးတော့တာပဲ ။ ဌာနကလည်း အထောက်အထား ခိုင်မာတယ် ဆိုပြီး မြေအရောင်းအဝယ်စာချုပ်ချုပ်ဖို့မြေပုံ/ မြေရာဇဝင်ထုတ်ပေးလိုက်တဲ့အခါ၊ အဲဒီမှာ ပြသာနာပေါ်တော့တာဘဲ၊  အဲဒီလူကြီးဝယ်ထားတဲ့ မြေနှင့်အိမ် အမည်ပေါက်ပိုင်ရှင် ဟာသေသွားတာ က (၅) နှစ် (၁၀) နှစ်ရှိပါပြီဆိုပြီး၊ အသိမိတ်ဆွေကဖြစ်စေ၊ အိမ်နီးနားချင်းကဖြစ်စေ၊ သေသူအမည်ပေါက်ရဲ့သားသမီးတို့ကဖြစ်စေ လာရောက် ကန့်ကွက်တဲ့အခါ လိမ်စဉ်ကြီးပေါ်တော့တာဘဲ။ ဒီတော့မြို့တော်ခန်းမမှာ နှစ်ဖက်ခေါ်ယူညှိနိုင်းဖြေရှင်းပေး ရတာတွေရှိလို့(၃) နှစ်ကျော် ပါဝါတွေလက်မခံဖို့ရုံးတွင် အမိန့်ထုတ်ထားတာဖြစ်တယ်လို့သိရပါတယ် ။
နောက်ထပ်မံသိရတာကတော့ကန်ထရိုက် နဲ့မြေရှင် General Power (အထွေထွေ ကိုယ်စားလှယ် လွှဲစာ) ပေးတဲ့ကိစ္စပါပဲ။မြေရှင်နဲ့ကန်ထရိုက် တိုက်ဆောက်တဲ့အခါ သက်မှတ်ချိန်ကာလ မပြီးတာတို့၊ ကန်ထရိုက်ဘက် ကအကြောင်းအမျိုးမျိုးကြောင့် ရပ်ဆိုင်းတာတို့ဖြစ်ပေါ်လာရင် ကန်ထရိုက်တာက(GP) ကိုမြေရှင်ထံ ပြန်မပေးကြဘူး။ နှစ်အကြာကြီးကိုင်ထားတက် ကြတယ်။အဲဒီအခါမှာ မြေရှင် နဲ ကန်ထရိုက်တာ နဲ့အငြင်းအခုံဖြစ်ကြတာ မပြီးနိုင်တော့ဘူး။ သတင်းစာတွေမှာ ရှေ့နေတွေနဲ အပြန်အလှန် ပြောကြတာတွေ အဆွေတော် ဖတ်ဖူးမှာပါ ။အဲဒီလိုကိစ္စမျိုတွေကြောင့်ပထမ SP/GP ပါဝါ တစ်နှစ်လို့သတ်မှတ်တယ်။နောက်ပိုင်း သုံးနှစ် ဆိုပြီး သတ်မှတ်လိုက်တယ်။ အခုတော့ အဲဒီ သတ်မှတ် ချက်ကို 2014 နှစ်လယ်ပိုင်း ကစပြီး ရုပ်သိမ်း လိုက်တယ် လို့သိရပါတယ် ။
ဒါကြောင့်အဆွေတော် လက်ထဲမှာရှိတဲ့(SP ဖြစ်စေ ၊GP ဖြစ်စေ )(၃) နှစ်ကျော်သွားပေမယ့်မြို့တော်စည်ပင်သာယာ မြေစီမံခန် ခွဲမှု ဌာန ကလက်ခံပါ တယ်လို့ သတင်းကောင်းပါ လိုက်ပါရစေ ။ သတိပြုရန် ကိုယ်စားလှယ် လွှဲစာ (SP/GP )ကို လွှဲအပ် သူကိုယ်တိုင် ရုပ်သိမ်းပြီး ၊လက်ခံသူကိုယ်တိုင် ကိုယ်စားလှယ် လွှဲစာပြန်အပ်ခြင်း၊ လက်ခံသူပြန်အပ်သူ နှစ်ဦးစလုံးသေခြင်း၊ စိတ်မနှံရူးသွပ်သွားခြင်း၊ လူမွဲ ဖြစ်သွားခဲ့လျှင်တော့ကိုယ်စားလှယ်ရဲ့အခွင့်အရေး ဆုံးရှံးသွားကြောင်း ပဋိညာန် ဥပဒေပုဒ်မ -၂၀၁ နှင့်ကိုယ်စားလှယ် လွှဲအပ်ခြင်း ဥပဒေ (The power of Attorney Act ) ပုဒ်မ-၃ မှာပြဌာန်းထားပါတယ်။
ကူးယူဖော်ပြခြင်းဖြစ်ပါသည်။
`))
console.log(translator.convertToMyanglish('ကျွန်မတို့နိုင်ငံတော်ကြီးက fdsa', {mode: ConvertMode.ADD_BRACKET_UNKNOWN_KEYWORDS}));
console.log(translator.convertToBurmese('bite sar lo a pyin twar chin dl jfdoksajfs', {mode: ConvertMode.ADD_BRACKET_UNKNOWN_KEYWORDS}));
console.log(translator.getDatasetCount());
console.log(translator.textSimilarity("ကျွန်မတို့နိုင်ငံတော်ကြီးက", 'ကျွန်မတို့နိုင်ငံတော်ကြီးက'))